---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCGeometryInfo
source: html/741c57df-a409-ea0d-8cb8-edc93c19b74d.htm
---
# Autodesk.Revit.DB.IFC.IFCGeometryInfo

A container class for Revit geometry extracted from an element.

## Syntax (C#)
```csharp
public class IFCGeometryInfo : IDisposable
```